MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2GH6J0AGV20000/mcu.h
typedef struct stc_rtc_wtcalen_field
{
        __IO   uint8_t  WTCALEN                  :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_rtc_wtcalen_field_t;

typedef struct stc_rtc_wtdiv_field
{
    union {
        struct {
            __IO   uint8_t  WTDIV                :4;
            __IO   uint8_t  RESERVED0            :4;
        };
        struct {
            __IO   uint8_t  WTDIV0               :1;
            __IO   uint8_t  WTDIV1               :1;
            __IO   uint8_t  WTDIV2               :1;
            __IO   uint8_t  WTDIV3               :1;
            __IO   uint8_t  RESERVED1            :4;
        };
    };
} stc_rtc_wtdiv_field_t;

typedef struct stc_rtc_wtdiven_field
{
        __IO   uint8_t  WTDIVEN                  :1;
        __IO   uint8_t  WTDIVRDY                 :1;
        __IO   uint8_t  RESERVED0                :6;
} stc_rtc_wtdiven_field_t;

typedef struct stc_rtc_wtcalprd_field
{
    union {
        struct {
            __IO   uint8_t  WTCALPRD             :6;
            __IO   uint8_t  RESERVED0            :2;
        };
        struct {
            __IO   uint8_t  WTCALPRD0            :1;
            __IO   uint8_t  WTCALPRD1            :1;
            __IO   uint8_t  WTCALPRD2            :1;
            __IO   uint8_t  WTCALPRD3            :1;
            __IO   uint8_t  WTCALPRD4            :1;
            __IO   uint8_t  WTCALPRD5            :1;
            __IO   uint8_t  RESERVED1            :2;
        };
    };
} stc_rtc_wtcalprd_field_t;

typedef struct stc_rtc_wtcosel_field
{
        __IO   uint8_t  WTCOSEL                  :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_rtc_wtcosel_field_t;

/******************************************************************************
 ** SBSSR_MODULE
 ** 
 ******************************************************************************/
typedef struct stc_sbssr_btsssr_field
{
        __IO  uint16_t  SSSR0                    :1;
        __IO  uint16_t  SSSR1                    :1;
        __IO  uint16_t  SSSR2                    :1;
        __IO  uint16_t  SSSR3                    :1;
        __IO  uint16_t  SSSR4                    :1;
        __IO  uint16_t  SSSR5                    :1;
        __IO  uint16_t  SSSR6                    :1;
        __IO  uint16_t  SSSR7                    :1;
        __IO  uint16_t  SSSR8                    :1;
        __IO  uint16_t  SSSR9                    :1;
        __IO  uint16_t  SSSR10                   :1;
        __IO  uint16_t  SSSR11                   :1;
        __IO  uint16_t  SSSR12                   :1;
        __IO  uint16_t  SSSR13                   :1;
        __IO  uint16_t  SSSR14                   :1;
        __IO  uint16_t  SSSR15                   :1;
} stc_sbssr_btsssr_field_t;

/******************************************************************************
 ** SDIF_MODULE
 ** 
 ******************************************************************************/
typedef struct stc_sdif_sbsize_field
{
    union {
        struct {
            __IO  uint16_t  TRSFBLCKSZ           :12;
            __IO  uint16_t  HSDMABUFBD           :3;
            __IO  uint16_t  RESERVED0            :1;
        };
        struct {
            __IO  uint16_t  TRSFBLCKSZ0          :1;
            __IO  uint16_t  TRSFBLCKSZ1          :1;
            __IO  uint16_t  TRSFBLCKSZ2          :1;
            __IO  uint16_t  TRSFBLCKSZ3          :1;
            __IO  uint16_t  TRSFBLCKSZ4          :1;
            __IO  uint16_t  TRSFBLCKSZ5          :1;
            __IO  uint16_t  TRSFBLCKSZ6          :1;
            __IO  uint16_t  TRSFBLCKSZ7          :1;
            __IO  uint16_t  TRSFBLCKSZ8          :1;
            __IO  uint16_t  TRSFBLCKSZ9          :1;
            __IO  uint16_t  TRSFBLCKSZ10         :1;
            __IO  uint16_t  TRSFBLCKSZ11         :1;
            __IO  uint16_t  HSDMABUFBD0          :1;
            __IO  uint16_t  HSDMABUFBD1          :1;
            __IO  uint16_t  HSDMABUFBD2          :1;
            __IO  uint16_t  RESERVED1            :1;
        };
    };
} stc_sdif_sbsize_field_t;

typedef struct stc_sdif_strsfmd_field
{
    union {
        struct {
            __IO  uint16_t  DMAEN                :1;
            __IO  uint16_t  BLCKCNTEN            :1;
            __IO  uint16_t  AUTOCMDEN            :2;
            __IO  uint16_t  DTTRSFDIR            :1;
            __IO  uint16_t  BLCKCNTSEL           :1;
            __IO  uint16_t  RESERVED1            :10;
        };
        struct {
            __IO  uint16_t  RESERVED0            :2;
            __IO  uint16_t  AUTOCMDEN0           :1;
            __IO  uint16_t  AUTOCMDEN1           :1;
            __IO  uint16_t  RESERVED2            :12;
        };
    };
} stc_sdif_strsfmd_field_t;

typedef struct stc_sdif_scmmd_field
{
    union {
        struct {
            __IO  uint16_t  RESPTYPE             :2;
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  CMDCRCCHKE           :1;
            __IO  uint16_t  CMDIDXCHKE           :1;
            __IO  uint16_t  DATPRESSEL           :1;
            __IO  uint16_t  CMDTYPE              :2;
            __IO  uint16_t  CMDINDEX             :6;
            __IO  uint16_t  RESERVED2            :2;
        };
        struct {
            __IO  uint16_t  RESPTYPE0            :1;
            __IO  uint16_t  RESPTYPE1            :1;
            __IO  uint16_t  RESERVED1            :4;
            __IO  uint16_t  CMDTYPE0             :1;
            __IO  uint16_t  CMDTYPE1             :1;
            __IO  uint16_t  CMDINDEX0            :1;
            __IO  uint16_t  CMDINDEX1            :1;
            __IO  uint16_t  CMDINDEX2            :1;
            __IO  uint16_t  CMDINDEX3            :1;
            __IO  uint16_t  CMDINDEX4            :1;
            __IO  uint16_t  CMDINDEX5            :1;
            __IO  uint16_t  RESERVED3            :2;
        };
    };
} stc_sdif_scmmd_field_t;

