MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2GH6J0AGV20000/mcu.h
typedef struct stc_sdif_stunsth_field
{
    union {
        struct {
            __IO  uint16_t  PRSTTNPNT            :8;
            __IO  uint16_t  RESERVED0            :8;
        };
        struct {
            __IO  uint16_t  PRSTTNPNT0           :1;
            __IO  uint16_t  PRSTTNPNT1           :1;
            __IO  uint16_t  PRSTTNPNT2           :1;
            __IO  uint16_t  PRSTTNPNT3           :1;
            __IO  uint16_t  PRSTTNPNT4           :1;
            __IO  uint16_t  PRSTTNPNT5           :1;
            __IO  uint16_t  PRSTTNPNT6           :1;
            __IO  uint16_t  PRSTTNPNT7           :1;
            __IO  uint16_t  RESERVED1            :8;
        };
    };
} stc_sdif_stunsth_field_t;

typedef struct stc_sdif_pswistl_field
{
        __IO  uint16_t  INT5MS                   :1;
        __IO  uint16_t  INT1MS                   :1;
        __IO  uint16_t  RESERVED0                :14;
} stc_sdif_pswistl_field_t;

typedef struct stc_sdif_pswistel_field
{
        __IO  uint16_t  INT5MSSTS                :1;
        __IO  uint16_t  INT1MSSTS                :1;
        __IO  uint16_t  RESERVED0                :14;
} stc_sdif_pswistel_field_t;

typedef struct stc_sdif_pswisgel_field
{
        __IO  uint16_t  INT5MSSGEN               :1;
        __IO  uint16_t  INT1MSSGEN               :1;
        __IO  uint16_t  RESERVED0                :14;
} stc_sdif_pswisgel_field_t;

typedef struct stc_sdif_mmcsdcl_field
{
        __IO  uint16_t  LCKRSTESD                :1;
        __IO  uint16_t  RSTMMC                   :1;
        __IO  uint16_t  VCCCTLMMC                :1;
        __IO  uint16_t  VCCQCTLMMC               :1;
        __IO  uint16_t  RESERVED0                :4;
        __IO  uint16_t  MMCDDRSEL                :1;
        __IO  uint16_t  CMDDATDLY                :1;
        __IO  uint16_t  RESERVED1                :6;
} stc_sdif_mmcsdcl_field_t;

typedef struct stc_sdif_mmcsdch_field
{
        __IO  uint16_t  BTACKENMMC               :1;
        __IO  uint16_t  BTABTENMMC               :1;
        __IO  uint16_t  BTMDENMMC                :1;
        __IO  uint16_t  RESERVED0                :13;
} stc_sdif_mmcsdch_field_t;

typedef struct stc_sdif_mcwirqc0_field
{
        __IO  uint16_t  WTIRQEN                  :1;
        __IO  uint16_t  WTIRQST                  :1;
        __IO  uint16_t  RESERVED0                :14;
} stc_sdif_mcwirqc0_field_t;

typedef struct stc_sdif_mcwirqc1_field
{
    union {
        struct {
            __IO  uint16_t  WTIRQCNCLR           :16;
        };
        struct {
            __IO  uint16_t  WTIRQCNCLR0          :1;
            __IO  uint16_t  WTIRQCNCLR1          :1;
            __IO  uint16_t  WTIRQCNCLR2          :1;
            __IO  uint16_t  WTIRQCNCLR3          :1;
            __IO  uint16_t  WTIRQCNCLR4          :1;
            __IO  uint16_t  WTIRQCNCLR5          :1;
            __IO  uint16_t  WTIRQCNCLR6          :1;
            __IO  uint16_t  WTIRQCNCLR7          :1;
            __IO  uint16_t  WTIRQCNCLR8          :1;
            __IO  uint16_t  WTIRQCNCLR9          :1;
            __IO  uint16_t  WTIRQCNCLR10         :1;
            __IO  uint16_t  WTIRQCNCLR11         :1;
            __IO  uint16_t  WTIRQCNCLR12         :1;
            __IO  uint16_t  WTIRQCNCLR13         :1;
            __IO  uint16_t  WTIRQCNCLR14         :1;
            __IO  uint16_t  WTIRQCNCLR15         :1;
        };
    };
} stc_sdif_mcwirqc1_field_t;

typedef struct stc_sdif_mcwirqc2_field
{
    union {
        struct {
            __IO  uint16_t  WTIRQCNCLR           :16;
        };
        struct {
            __IO  uint16_t  WTIRQCNCLR0          :1;
            __IO  uint16_t  WTIRQCNCLR1          :1;
            __IO  uint16_t  WTIRQCNCLR2          :1;
            __IO  uint16_t  WTIRQCNCLR3          :1;
            __IO  uint16_t  WTIRQCNCLR4          :1;
            __IO  uint16_t  WTIRQCNCLR5          :1;
            __IO  uint16_t  WTIRQCNCLR6          :1;
            __IO  uint16_t  WTIRQCNCLR7          :1;
            __IO  uint16_t  WTIRQCNCLR8          :1;
            __IO  uint16_t  WTIRQCNCLR9          :1;
            __IO  uint16_t  WTIRQCNCLR10         :1;
            __IO  uint16_t  WTIRQCNCLR11         :1;
            __IO  uint16_t  WTIRQCNCLR12         :1;
            __IO  uint16_t  WTIRQCNCLR13         :1;
            __IO  uint16_t  WTIRQCNCLR14         :1;
            __IO  uint16_t  WTIRQCNCLR15         :1;
        };
    };
} stc_sdif_mcwirqc2_field_t;

typedef struct stc_sdif_mcwirqc3_field
{
    union {
        struct {
            __IO  uint16_t  WTIRQCNCLR           :16;
        };
        struct {
            __IO  uint16_t  WTIRQCNCLR0          :1;
            __IO  uint16_t  WTIRQCNCLR1          :1;
            __IO  uint16_t  WTIRQCNCLR2          :1;
            __IO  uint16_t  WTIRQCNCLR3          :1;
            __IO  uint16_t  WTIRQCNCLR4          :1;
            __IO  uint16_t  WTIRQCNCLR5          :1;
            __IO  uint16_t  WTIRQCNCLR6          :1;
            __IO  uint16_t  WTIRQCNCLR7          :1;
            __IO  uint16_t  WTIRQCNCLR8          :1;
            __IO  uint16_t  WTIRQCNCLR9          :1;
            __IO  uint16_t  WTIRQCNCLR10         :1;
            __IO  uint16_t  WTIRQCNCLR11         :1;
            __IO  uint16_t  WTIRQCNCLR12         :1;
            __IO  uint16_t  WTIRQCNCLR13         :1;
            __IO  uint16_t  WTIRQCNCLR14         :1;
            __IO  uint16_t  WTIRQCNCLR15         :1;
        };
    };
} stc_sdif_mcwirqc3_field_t;

typedef struct stc_sdif_mcrpckbl_field
{
    union {
        struct {
            __IO  uint16_t  CHECKBIT1            :7;
            __IO  uint16_t  CHECKBIT2            :6;
            __IO  uint16_t  RESERVED0            :3;
        };
        struct {
            __IO  uint16_t  CHECKBIT10           :1;
            __IO  uint16_t  CHECKBIT11           :1;
            __IO  uint16_t  CHECKBIT12           :1;
            __IO  uint16_t  CHECKBIT13           :1;
            __IO  uint16_t  CHECKBIT14           :1;
            __IO  uint16_t  CHECKBIT15           :1;
            __IO  uint16_t  CHECKBIT16           :1;
            __IO  uint16_t  CHECKBIT20           :1;
            __IO  uint16_t  CHECKBIT21           :1;
            __IO  uint16_t  CHECKBIT22           :1;
            __IO  uint16_t  CHECKBIT23           :1;
            __IO  uint16_t  CHECKBIT24           :1;
            __IO  uint16_t  CHECKBIT25           :1;
            __IO  uint16_t  RESERVED1            :3;
        };
    };
} stc_sdif_mcrpckbl_field_t;

