MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2GH6J0AGV20000/mcu.h
        stc_gpio_epfr24_field_t EPFR24_f;
        struct {
          union {
            __IO uint16_t EPFR24L;
            struct {
              __IO uint8_t EPFR24LL;
              __IO uint8_t EPFR24LH;
            };
          };
          union {
            __IO uint16_t EPFR24H;
            struct {
              __IO uint8_t EPFR24HL;
              __IO uint8_t EPFR24HH;
            };
          };
        };
    };
    union {
        __IO uint32_t EPFR25;
        stc_gpio_epfr25_field_t EPFR25_f;
        struct {
          union {
            __IO uint16_t EPFR25L;
            struct {
              __IO uint8_t EPFR25LL;
              __IO uint8_t EPFR25LH;
            };
          };
          union {
            __IO uint16_t EPFR25H;
            struct {
              __IO uint8_t EPFR25HL;
              __IO uint8_t EPFR25HH;
            };
          };
        };
    };
    union {
        __IO uint32_t EPFR26;
        stc_gpio_epfr26_field_t EPFR26_f;
        struct {
          union {
            __IO uint16_t EPFR26L;
            struct {
              __IO uint8_t EPFR26LL;
              __IO uint8_t EPFR26LH;
            };
          };
          union {
            __IO uint16_t EPFR26H;
            struct {
              __IO uint8_t EPFR26HL;
              __IO uint8_t EPFR26HH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED8[24];
    union {
        __IO uint32_t EPFR33;
        stc_gpio_epfr33_field_t EPFR33_f;
        struct {
          union {
            __IO uint16_t EPFR33L;
            struct {
              __IO uint8_t EPFR33LL;
              __IO uint8_t EPFR33LH;
            };
          };
          union {
            __IO uint16_t EPFR33H;
            struct {
              __IO uint8_t EPFR33HL;
              __IO uint8_t EPFR33HH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED9[4];
    union {
        __IO uint32_t EPFR35;
        stc_gpio_epfr35_field_t EPFR35_f;
        struct {
          union {
            __IO uint16_t EPFR35L;
            struct {
              __IO uint8_t EPFR35LL;
              __IO uint8_t EPFR35LH;
            };
          };
          union {
            __IO uint16_t EPFR35H;
            struct {
              __IO uint8_t EPFR35HL;
              __IO uint8_t EPFR35HH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED10[112];
    union {
        __IO uint32_t PZR0;
        stc_gpio_pzr0_field_t PZR0_f;
        struct {
          union {
            __IO uint16_t PZR0L;
            struct {
              __IO uint8_t PZR0LL;
              __IO uint8_t PZR0LH;
            };
          };
          union {
            __IO uint16_t PZR0H;
            struct {
              __IO uint8_t PZR0HL;
              __IO uint8_t PZR0HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZR1;
        stc_gpio_pzr1_field_t PZR1_f;
        struct {
          union {
            __IO uint16_t PZR1L;
            struct {
              __IO uint8_t PZR1LL;
              __IO uint8_t PZR1LH;
            };
          };
          union {
            __IO uint16_t PZR1H;
            struct {
              __IO uint8_t PZR1HL;
              __IO uint8_t PZR1HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZR2;
        stc_gpio_pzr2_field_t PZR2_f;
        struct {
          union {
            __IO uint16_t PZR2L;
            struct {
              __IO uint8_t PZR2LL;
              __IO uint8_t PZR2LH;
            };
          };
          union {
            __IO uint16_t PZR2H;
            struct {
              __IO uint8_t PZR2HL;
              __IO uint8_t PZR2HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZR3;
        stc_gpio_pzr3_field_t PZR3_f;
        struct {
          union {
            __IO uint16_t PZR3L;
            struct {
              __IO uint8_t PZR3LL;
              __IO uint8_t PZR3LH;
            };
          };
          union {
            __IO uint16_t PZR3H;
            struct {
              __IO uint8_t PZR3HL;
              __IO uint8_t PZR3HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZR4;
        stc_gpio_pzr4_field_t PZR4_f;
        struct {
          union {
            __IO uint16_t PZR4L;
            struct {
              __IO uint8_t PZR4LL;
              __IO uint8_t PZR4LH;
            };
          };
          union {
            __IO uint16_t PZR4H;
            struct {
              __IO uint8_t PZR4HL;
              __IO uint8_t PZR4HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZR5;
        struct {
          union {
            __IO uint16_t PZR5L;
            struct {
              __IO uint8_t PZR5LL;
              __IO uint8_t PZR5LH;
            };
          };
          union {
            __IO uint16_t PZR5H;
            struct {
              __IO uint8_t PZR5HL;
              __IO uint8_t PZR5HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZR6;
        stc_gpio_pzr6_field_t PZR6_f;
        struct {
          union {
            __IO uint16_t PZR6L;
            struct {
              __IO uint8_t PZR6LL;
              __IO uint8_t PZR6LH;
            };
          };
          union {
            __IO uint16_t PZR6H;
            struct {
              __IO uint8_t PZR6HL;
              __IO uint8_t PZR6HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZR7;
        stc_gpio_pzr7_field_t PZR7_f;
        struct {
          union {
            __IO uint16_t PZR7L;
            struct {
              __IO uint8_t PZR7LL;
              __IO uint8_t PZR7LH;
            };
          };
          union {
            __IO uint16_t PZR7H;
            struct {
              __IO uint8_t PZR7HL;
              __IO uint8_t PZR7HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZR8;
        stc_gpio_pzr8_field_t PZR8_f;
        struct {
          union {
            __IO uint16_t PZR8L;
            struct {
              __IO uint8_t PZR8LL;
              __IO uint8_t PZR8LH;
            };
          };
          union {
            __IO uint16_t PZR8H;
            struct {
              __IO uint8_t PZR8HL;
              __IO uint8_t PZR8HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZR9;
        struct {
          union {
            __IO uint16_t PZR9L;
            struct {
              __IO uint8_t PZR9LL;
              __IO uint8_t PZR9LH;
            };
          };
          union {
            __IO uint16_t PZR9H;
            struct {
              __IO uint8_t PZR9HL;
              __IO uint8_t PZR9HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZRA;
        stc_gpio_pzra_field_t PZRA_f;
        struct {
          union {
            __IO uint16_t PZRAL;
            struct {
              __IO uint8_t PZRALL;
              __IO uint8_t PZRALH;
            };
          };
          union {
            __IO uint16_t PZRAH;
            struct {
              __IO uint8_t PZRAHL;
              __IO uint8_t PZRAHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZRB;
        struct {
          union {
            __IO uint16_t PZRBL;
            struct {
              __IO uint8_t PZRBLL;
              __IO uint8_t PZRBLH;
            };
          };
          union {
            __IO uint16_t PZRBH;
            struct {
              __IO uint8_t PZRBHL;
              __IO uint8_t PZRBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZRC;
        stc_gpio_pzrc_field_t PZRC_f;
        struct {
          union {
            __IO uint16_t PZRCL;
            struct {
              __IO uint8_t PZRCLL;
              __IO uint8_t PZRCLH;
            };
          };
          union {
            __IO uint16_t PZRCH;
            struct {
              __IO uint8_t PZRCHL;
              __IO uint8_t PZRCHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZRD;
        stc_gpio_pzrd_field_t PZRD_f;
        struct {
          union {
            __IO uint16_t PZRDL;
            struct {
              __IO uint8_t PZRDLL;
              __IO uint8_t PZRDLH;
            };
          };
          union {
            __IO uint16_t PZRDH;
            struct {
              __IO uint8_t PZRDHL;
              __IO uint8_t PZRDHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZRE;
        stc_gpio_pzre_field_t PZRE_f;
        struct {
          union {
            __IO uint16_t PZREL;
            struct {
              __IO uint8_t PZRELL;
              __IO uint8_t PZRELH;
            };
          };
          union {
            __IO uint16_t PZREH;
            struct {
              __IO uint8_t PZREHL;
              __IO uint8_t PZREHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZRF;
        struct {
          union {
            __IO uint16_t PZRFL;
            struct {
              __IO uint8_t PZRFLL;
              __IO uint8_t PZRFLH;
            };
          };
          union {
            __IO uint16_t PZRFH;
            struct {
              __IO uint8_t PZRFHL;
              __IO uint8_t PZRFHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PDSR0;
        stc_gpio_pdsr0_field_t PDSR0_f;
        struct {
          union {
            __IO uint16_t PDSR0L;
            struct {
              __IO uint8_t PDSR0LL;
              __IO uint8_t PDSR0LH;
            };
          };
          union {
            __IO uint16_t PDSR0H;
            struct {
              __IO uint8_t PDSR0HL;
              __IO uint8_t PDSR0HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PDSR1;
        stc_gpio_pdsr1_field_t PDSR1_f;
        struct {
          union {
            __IO uint16_t PDSR1L;
            struct {
              __IO uint8_t PDSR1LL;
              __IO uint8_t PDSR1LH;
            };
          };
          union {
            __IO uint16_t PDSR1H;
            struct {
              __IO uint8_t PDSR1HL;
              __IO uint8_t PDSR1HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PDSR2;
        stc_gpio_pdsr2_field_t PDSR2_f;
        struct {
          union {
            __IO uint16_t PDSR2L;
            struct {
              __IO uint8_t PDSR2LL;
              __IO uint8_t PDSR2LH;
            };
          };
          union {
            __IO uint16_t PDSR2H;
            struct {
              __IO uint8_t PDSR2HL;
              __IO uint8_t PDSR2HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PDSR3;
        stc_gpio_pdsr3_field_t PDSR3_f;
        struct {
          union {
            __IO uint16_t PDSR3L;
            struct {
              __IO uint8_t PDSR3LL;
              __IO uint8_t PDSR3LH;
            };
          };
          union {
            __IO uint16_t PDSR3H;
            struct {
              __IO uint8_t PDSR3HL;
              __IO uint8_t PDSR3HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PDSR4;
        stc_gpio_pdsr4_field_t PDSR4_f;
        struct {
          union {
            __IO uint16_t PDSR4L;
            struct {
              __IO uint8_t PDSR4LL;
              __IO uint8_t PDSR4LH;
            };
          };
          union {
            __IO uint16_t PDSR4H;
            struct {
              __IO uint8_t PDSR4HL;
              __IO uint8_t PDSR4HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PDSR5;
        struct {
          union {
            __IO uint16_t PDSR5L;
            struct {
              __IO uint8_t PDSR5LL;
              __IO uint8_t PDSR5LH;
            };
          };
          union {
            __IO uint16_t PDSR5H;
            struct {
              __IO uint8_t PDSR5HL;
              __IO uint8_t PDSR5HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PDSR6;
        stc_gpio_pdsr6_field_t PDSR6_f;
        struct {
          union {
            __IO uint16_t PDSR6L;
            struct {
              __IO uint8_t PDSR6LL;
              __IO uint8_t PDSR6LH;
            };
          };
          union {
            __IO uint16_t PDSR6H;
            struct {
              __IO uint8_t PDSR6HL;
              __IO uint8_t PDSR6HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PDSR7;
        stc_gpio_pdsr7_field_t PDSR7_f;
        struct {
          union {
            __IO uint16_t PDSR7L;
            struct {
              __IO uint8_t PDSR7LL;
              __IO uint8_t PDSR7LH;
            };
          };
          union {
            __IO uint16_t PDSR7H;
            struct {
              __IO uint8_t PDSR7HL;
              __IO uint8_t PDSR7HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PDSR8;
        stc_gpio_pdsr8_field_t PDSR8_f;
        struct {
          union {
            __IO uint16_t PDSR8L;
            struct {
              __IO uint8_t PDSR8LL;
              __IO uint8_t PDSR8LH;
            };
          };
          union {
            __IO uint16_t PDSR8H;
            struct {
              __IO uint8_t PDSR8HL;
              __IO uint8_t PDSR8HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PDSR9;
        struct {
          union {
            __IO uint16_t PDSR9L;
            struct {
              __IO uint8_t PDSR9LL;
              __IO uint8_t PDSR9LH;
            };
          };
          union {
            __IO uint16_t PDSR9H;
            struct {
              __IO uint8_t PDSR9HL;
              __IO uint8_t PDSR9HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PDSRA;
        stc_gpio_pdsra_field_t PDSRA_f;
        struct {
          union {
            __IO uint16_t PDSRAL;
            struct {
              __IO uint8_t PDSRALL;
              __IO uint8_t PDSRALH;
            };
          };
          union {
            __IO uint16_t PDSRAH;
            struct {
              __IO uint8_t PDSRAHL;
              __IO uint8_t PDSRAHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PDSRB;
        struct {
          union {
            __IO uint16_t PDSRBL;
            struct {
              __IO uint8_t PDSRBLL;
              __IO uint8_t PDSRBLH;
            };
          };
          union {
            __IO uint16_t PDSRBH;
            struct {
              __IO uint8_t PDSRBHL;
              __IO uint8_t PDSRBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PDSRC;
        stc_gpio_pdsrc_field_t PDSRC_f;
        struct {
          union {
            __IO uint16_t PDSRCL;
            struct {
              __IO uint8_t PDSRCLL;
              __IO uint8_t PDSRCLH;
            };
          };
          union {
            __IO uint16_t PDSRCH;
            struct {
              __IO uint8_t PDSRCHL;
              __IO uint8_t PDSRCHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PDSRD;
        stc_gpio_pdsrd_field_t PDSRD_f;
        struct {
          union {
            __IO uint16_t PDSRDL;
            struct {
              __IO uint8_t PDSRDLL;
              __IO uint8_t PDSRDLH;
            };
          };
          union {
            __IO uint16_t PDSRDH;
            struct {
              __IO uint8_t PDSRDHL;
              __IO uint8_t PDSRDHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PDSRE;
        stc_gpio_pdsre_field_t PDSRE_f;
        struct {
          union {
            __IO uint16_t PDSREL;
            struct {
              __IO uint8_t PDSRELL;
              __IO uint8_t PDSRELH;
            };
          };
          union {
            __IO uint16_t PDSREH;
            struct {
              __IO uint8_t PDSREHL;
              __IO uint8_t PDSREHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PDSRF;
        struct {
          union {
            __IO uint16_t PDSRFL;
            struct {
              __IO uint8_t PDSRFLL;
              __IO uint8_t PDSRFLH;
            };
          };
          union {
            __IO uint16_t PDSRFH;
            struct {
              __IO uint8_t PDSRFHL;
              __IO uint8_t PDSRFHH;
            };
          };
        };
    };
} FM_GPIO_TypeDef, FM4_GPIO_TypeDef;

